PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
		bdshot_note_failure(ch, channel, true);
		return;
	}

	struct BDShotTelemetry packet = {};

	decode_dshot_telemetry(payload, &packet);

	switch (packet.type) {
	case DSHOT_EDT_ERPM:
		ch->erpm = packet.value;
		ch->erpm_valid = true;
		break;

	case DSHOT_EDT_TEMPERATURE:
		ch->edt_temp.value = packet.value;
		ch->edt_temp.ready = true;
		break;

	case DSHOT_EDT_VOLTAGE:
		ch->edt_volt.value = packet.value;
		ch->edt_volt.ready = true;
		break;

	case DSHOT_EDT_CURRENT:
		ch->edt_curr.value = packet.value;
		ch->edt_curr.ready = true;
		break;

	default:
		break;
	}

	bdshot_note_success(ch);
}

int up_dshot_init(uint32_t channel_mask, uint32_t bdshot_channel_mask, unsigned dshot_pwm_freq, bool edt_enable)
{
	imxrt_clockall_flexio1();

	// Reset the peripheral before the driver state so a stale IRQ has nothing to service
	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0, FLEXIO_CTRL_SWRST_MASK);
	flexio_putreg32(0, IMXRT_FLEXIO_CTRL_OFFSET);

	memset((void *)dshot_inst, 0, sizeof(dshot_inst));
	bdshot_ready_mask = 0;
	_dshot_armed = false;
	_edt_enabled = edt_enable;
	dshot_speed = dshot_pwm_freq;
	dshot_tcmp = 0x2F00 | (((BOARD_FLEXIO_PREQ / (dshot_pwm_freq * 3) / 2) - 1) & 0xFF);

	// 16-bit frame, ESC turnaround, 21-bit GCR response at 5/4 rate, margin for IRQ latency
	_bdshot_busy_us = (16u * 1000000u) / dshot_pwm_freq + 30u + (21u * 4u * 1000000u) / (5u * dshot_pwm_freq) + 50u;

	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET,
			   (FLEXIO_CTRL_DOZEN_MASK |
			    FLEXIO_CTRL_DBGE_MASK |
			    FLEXIO_CTRL_FASTACC_MASK |
			    FLEXIO_CTRL_FLEXEN_MASK),
			   (FLEXIO_CTRL_DBGE(1) |
			    FLEXIO_CTRL_FASTACC(1) |
			    FLEXIO_CTRL_FLEXEN(0)));

	irq_attach(IMXRT_IRQ_FLEXIO1, flexio_irq_handler, 0);
	up_enable_irq(IMXRT_IRQ_FLEXIO1);

	uint32_t dshot_mask = 0;

	for (unsigned channel = 0; channel < MAX_TIMER_IO_CHANNELS; channel++) {
		uint32_t bit = 1u << channel;

		if (((channel_mask | bdshot_channel_mask) & bit) == 0) {
			continue;
		}

		if (channel >= DSHOT_TIMERS || timer_io_channels[channel].dshot.pinmux == 0) {
			// Cannot capture, so it must never hold up DShot.cpp's all-channels-ready wait
			bdshot_ready_mask |= bit & bdshot_channel_mask;
			PX4_WARN("no FlexIO DShot on output %u", channel);
			continue;
		}

		volatile dshot_channel_t *ch = &dshot_inst[channel];

		imxrt_config_gpio(timer_io_channels[channel].dshot.pinmux | IOMUX_PULL_UP);

		ch->bdshot = (bdshot_channel_mask & bit) != 0;

		if (ch->bdshot) {
			ch->bdshot_tcmp_offset = BDSHOT_TCMP_MIN_OFFSET;
			flexio_dshot_set_tcmp(channel);
		}

		flexio_dshot_output(channel);
		ch->init = true;
		dshot_mask |= bit;
	}

	flexio_modifyreg32(IMXRT_FLEXIO_CTRL_OFFSET, 0, FLEXIO_CTRL_FLEXEN_MASK);

	return dshot_mask;
}

uint16_t up_bdshot_get_ready_mask(void)
{
	return (uint16_t)bdshot_ready_mask;
}

int up_bdshot_num_errors(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].crc_error_cnt + dshot_inst[channel].frame_error_cnt + dshot_inst[channel].no_response_cnt;
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	// Channels without capture keep their permanent ready bit, so return before clearing it
	if (channel >= DSHOT_TIMERS || !dshot_inst[channel].bdshot) {
		return -1;
	}

	int status = -1;

	if (dshot_inst[channel].erpm_valid) {
		*erpm = dshot_inst[channel].erpm;
		status = 0;
	}

	bdshot_ready_mask &= ~(1u << channel);
	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	if (channel >= DSHOT_TIMERS) {
		return -1;
	}

	volatile edt_sample_t *sample = NULL;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		sample = &dshot_inst[channel].edt_temp;
		break;

	case DSHOT_EDT_VOLTAGE:
		sample = &dshot_inst[channel].edt_volt;
		break;

	case DSHOT_EDT_CURRENT:
		sample = &dshot_inst[channel].edt_curr;
		break;

	default:
		return -1;
	}

	if (!sample->ready) {
		return -1;
	}

	*value = sample->value;
	sample->ready = false;
	return 0;
}

int up_bdshot_channel_capture_supported(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].init && dshot_inst[channel].bdshot;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= DSHOT_TIMERS) {
		return 0;
	}

	return dshot_inst[channel].online;
}

void up_bdshot_status(void)
{
	for (uint8_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		volatile dshot_channel_t *ch = &dshot_inst[channel];

		if (!ch->init) {
			continue;
		}

		PX4_INFO("Channel %i %s Last erpm %li value", channel, ch->online ? "online" : "offline", ch->erpm);

		if (_edt_enabled) {
			PX4_INFO("EDT Temp %u C  Volt %.2f V  Curr %u A",
				 ch->edt_temp.value, (double)ch->edt_volt.value * 0.25, ch->edt_curr.value);
		}

		PX4_INFO("BDSHOT Training done: %s TCMP offset: %d mask 0x%08lx", ch->bdshot_training_done ? "YES" : "NO",
			 ch->bdshot_tcmp_offset, ch->bdshot_training_mask);
		PX4_INFO("CRC errors Frame error No response");
		PX4_INFO("%10lu %11lu %11lu", ch->crc_error_cnt, ch->frame_error_cnt, ch->no_response_cnt);
	}
}

void up_dshot_trigger(void)
{
	if (!_dshot_armed) {
		return;
	}

	hrt_abstime now = hrt_absolute_time();
	uint32_t tx_mask = 0;

	// Lock-free: the IRQ only acts on a channel whose interrupt is enabled, and a channel is only
	// touched here once its cycle is over, so the two contexts never own the same channel at once.
	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		volatile dshot_channel_t *ch = &dshot_inst[channel];
		uint32_t bit = 1u << channel;

		if (!ch->init || ch->data_seg1 == 0) {
			continue;
		}

		if (ch->bdshot) {
			// A frame the IRQ has not consumed yet
			if (ch->state == BDSHOT_RECEIVE && (get_shifter_status_flags() & bit)) {
				bdshot_latch_response(channel);
			}

			// The ESC may still be driving the line
			if (ch->state != BDSHOT_RECEIVE_COMPLETE && (now - ch->tx_started) < _bdshot_busy_us) {
				continue;
			}

			if (ch->tx_started != 0) {
				bdshot_process_response(channel);
			}

			flexio_dshot_output(channel);
		}

		// SSF is the timer trigger (active low): it reads "buffer empty" here and only the SHIFTBUF
		// write may clear it, or the timer starts on an empty shifter. TSF is just a stale flag.
		clear_timer_status_flags(bit);
		tx_mask |= bit;
	}

	// The IRQ must queue the second word before the first 24 sub-bits are out (20 us at DShot1200), so
	// preemption cannot be allowed between the buffer write and the interrupt enable. SHIFTSIEN/TIMIEN
	// have no set/clear aliases, so the read-modify-write also has to be atomic against the IRQ's own.
	irqstate_t irqflags = px4_enter_critical_section();

	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (tx_mask & (1u << channel)) {
			dshot_inst[channel].state = DSHOT_START;
			dshot_inst[channel].tx_started = now;
			flexio_putreg32(dshot_inst[channel].data_seg1, IMXRT_FLEXIO_SHIFTBUF0_OFFSET + channel * 0x4);
		}
	}

	enable_shifter_status_interrupts(tx_mask);
	enable_timer_status_interrupts(tx_mask);
	px4_leave_critical_section(irqflags);
}

// Each DShot bit becomes three shifter bits: 110 for a one, 100 for a zero
static uint64_t dshot_expand_data(uint16_t packet)
{
	unsigned int mask;
	unsigned int index = 0;
	uint64_t expanded = 0x0;

	for (mask = 0x8000; mask != 0; mask >>= 1) {
		if (packet & mask) {
			expanded = expanded | ((uint64_t)0x3 << index);

		} else {
			expanded = expanded | ((uint64_t)0x1 << index);
		}

		index = index + 3;
	}

	return expanded;
}

