PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/dshot/dshot.c
// bits  1-11  throttle (0-47 are commands, 48-2047 give 2000 steps of throttle)
// bit   12    telemetry request
// bits  13-16 XOR checksum, inverted for bidirectional
void dshot_motor_data_set(uint8_t channel, uint16_t throttle, bool telemetry)
{
	if (channel >= DSHOT_TIMERS || !dshot_inst[channel].init) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= throttle << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = dshot_inst[channel].bdshot ? ~packet : packet;
	csum_data >>= NIBBLES_SIZE;

	for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F);
		csum_data >>= NIBBLES_SIZE;
	}

	packet |= (checksum & 0x0F);

	uint64_t dshot_expanded = dshot_expand_data(packet);

	dshot_inst[channel].data_seg1 = (uint32_t)(dshot_expanded & 0xFFFFFF);
	dshot_inst[channel].irq_data = (uint32_t)(dshot_expanded >> 24);
}

int up_dshot_arm(bool armed)
{
	uint32_t mask = 0;

	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (dshot_inst[channel].init) {
			mask |= 1u << channel;
		}
	}

	_dshot_armed = armed;

	if (!armed) {
		// Atomic against the IRQ's own SHIFTSIEN/TIMIEN updates; nothing fires once these are clear
		irqstate_t irqflags = px4_enter_critical_section();
		disable_shifter_status_interrupts(mask);
		disable_timer_status_interrupts(mask);
		px4_leave_critical_section(irqflags);

		for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
			if (mask & (1u << channel)) {
				flexio_putreg32(0, IMXRT_FLEXIO_TIMCTL0_OFFSET + channel * 0x4);
				flexio_putreg32(0, IMXRT_FLEXIO_SHIFTCTL0_OFFSET + channel * 0x4);
			}
		}

		return 0;
	}

	// Interrupts are off after init or disarm, so the IRQ cannot see this reconfiguration
	for (uint32_t channel = 0; channel < DSHOT_TIMERS; channel++) {
		if (mask & (1u << channel)) {
			// Nothing is in flight; the first trigger must not count a missing response
			dshot_inst[channel].tx_started = 0;
			flexio_dshot_output(channel);
		}
	}

	return 0;
}
